[M_NoteToSelf MissionDefinition]
MissionName="See for yourself"
MissionDescription="Known as the sick man, Goliath hid his weapons there [place]refrigerator[-place]. I understand."
TurnInDescription="I saw a gun bottle. Or, as Crank says, you have to buy a box of pom poms to get the sign."
MissionSummary="Turn the crank."
MissionGiver="He is called Goliath."
MissionTurnInLocation="refrigerator"
TeaserText="Goliath appears from time to time...."

[M_NoteToSelf:ClearIceSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_NoteToSelf:FindIceStatueSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_NoteToSelf:Killmidgets MissionObjectiveDefinition]
ProgressMessage="Kill ten dwarves"

[M_NoteToSelf:NoteToSelf_ClearIce MissionObjectiveDefinition]
ProgressMessage="Remove ice cubes"

[M_NoteToSelf:NoteToSelf_FindIceStatue MissionObjectiveDefinition]
ProgressMessage="Find a place to store weapons"

